app/controllers/galleries_controller.rb

	def index
		@galleries = Gallery.all
---
SELECT "galleries".* FROM "galleries"   ORDER BY "galleries"."created_at" DESC

	def show
		@gallery = Gallery.find(params[:id])
---
SELECT  "galleries".* FROM "galleries"  WHERE "galleries"."id" = $1 LIMIT 1  [["id", 1]]

	def create
		@gallery = Gallery.new(gallery_params)

		if @gallery.save
---
INSERT INTO "galleries" ("created_at", "title", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2014-09-02 01:29:09.550024"], ["title", "New Gallll"], ["updated_at", "2014-09-02 01:29:09.550024"]]

	def edit
		@gallery = Gallery.find(params[:id])
---
SELECT  "galleries".* FROM "galleries"  WHERE "galleries"."id" = $1 LIMIT 1  [["id", 1]]

	def update
		@gallery = Gallery.find(params[:id])

		if @gallery.update(gallery_params)
---
SELECT  "galleries".* FROM "galleries"  WHERE "galleries"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "galleries" SET "title" = $1, "updated_at" = $2 WHERE "galleries"."id" = 1  [["title", "Pokemon"], ["updated_at", "2014-09-02 01:32:18.380900"]]

	def destroy
		@gallery = Gallery.find(params[:id])
		@gallery.destroy
---
SELECT  "galleries".* FROM "galleries"  WHERE "galleries"."id" = $1 LIMIT 1  [["id", 5]]
DELETE FROM "galleries" WHERE "galleries"."id" = $1  [["id", 5]]