app/controllers/paintings_controller.rb

	def show
		@gallery = Gallery.find(params[:gallery_id])
		@painting = Painting.find(params[:id])
---
SELECT  "galleries".* FROM "galleries"  WHERE "galleries"."id" = $1 LIMIT 1  [["id", 3]]
SELECT  "paintings".* FROM "paintings"  WHERE "paintings"."id" = $1 LIMIT 1  [["id", 19]]

	def new
		@gallery = Gallery.find(params[:gallery_id])
---
SELECT  "galleries".* FROM "galleries"  WHERE "galleries"."id" = $1 LIMIT 1  [["id", 2]]

	def create
		@gallery = Gallery.find(params[:gallery_id])
		@painting = Painting.new(painting_params)
		@painting.gallery_id = params[:gallery_id]
		if @painting.save
---
SELECT  "galleries".* FROM "galleries"  WHERE "galleries"."id" = $1 LIMIT 1  [["id", 3]]
INSERT INTO "paintings" ("created_at", "gallery_id", "image", "title", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2014-09-02 02:32:25.554326"], ["gallery_id", 1], ["image", "illust-modal.jpg"], ["title", "dwqwwdddd"], ["updated_at", "2014-09-02 02:32:25.554326"]]

	def edit
		@gallery = Gallery.find(params[:gallery_id])
		@painting = Painting.find(params[:id])
---
SELECT  "galleries".* FROM "galleries"  WHERE "galleries"."id" = $1 LIMIT 1  [["id", 2]]
SELECT  "paintings".* FROM "paintings"  WHERE "paintings"."id" = $1 LIMIT 1  [["id", 2]]

	def update
		@gallery = Gallery.find(params[:gallery_id])
		@painting = Painting.find(params[:id])

		if @painting.update(painting_params)
---
SELECT  "galleries".* FROM "galleries"  WHERE "galleries"."id" = $1 LIMIT 1  [["id", 2]]
SELECT  "paintings".* FROM "paintings"  WHERE "paintings"."id" = $1 LIMIT 1  [["id", 36]]
UPDATE "paintings" SET "image" = $1, "title" = $2, "updated_at" = $3 WHERE "paintings"."id" = 36  [["image", "zelda1.jpg"], ["title", "Link - Awesome"], ["updated_at", "2014-09-02 21:53:18.354202"]]

	def destroy
		@gallery = Gallery.find(params[:gallery_id])
		@painting = Painting.find(params[:id])
		@painting.destroy
---
SELECT  "galleries".* FROM "galleries"  WHERE "galleries"."id" = $1 LIMIT 1  [["id", 16]]
SELECT  "paintings".* FROM "paintings"  WHERE "paintings"."id" = $1 LIMIT 1  [["id", 2]]
DELETE FROM "paintings" WHERE "paintings"."id" = $1  [["id", 2]]