app/views/galleries/index.html.erb

<h2><%= link_to "#{gallery.title}", gallery_path(gallery) %></h2><br>
<% if gallery.paintings.count > 0 %>
---
SELECT  "paintings".* FROM "paintings"  WHERE "paintings"."gallery_id" = $1  ORDER BY "paintings"."id" DESC LIMIT 1  [["gallery_id", 2]]
SELECT COUNT(*) FROM "paintings"  WHERE "paintings"."gallery_id" = $1  [["gallery_id", 2]]